### Pandas:  creating dataframes

One common way would be to read a csv file. Here, we create the file first.

In [10]:
import pandas as pd

In [11]:
s = '''
A,B,C
a,1,1.4142
b,4,1.6180
c,9,2.7183
d,16,3.1415
'''

fn = 'tmp'
with open(fn,'w') as fh:  fh.write(s)
df = pd.read_csv(fn)
df

   A   B       C
0  a   1  1.4142
1  b   4  1.6180
2  c   9  2.7183
3  d  16  3.1415

One can also read in a dictionary.

In [12]:
D = {'fips':['16','41','53'],'abbrev':['ID','OR','WA']}
df2 = pd.DataFrame(D)
df2

  fips abbrev
0   16     ID
1   41     OR
2   53     WA

Note that in the first example, we could have used the `io` module to treat the string as a file-like object:

In [13]:
import io
df3 = pd.read_csv(io.StringIO(s), sep=',')
df3

   A   B       C
0  a   1  1.4142
1  b   4  1.6180
2  c   9  2.7183
3  d  16  3.1415

In [14]:
df4 = df
print(id(df),id(df4))

4657329904 4657329904

In [15]:
df4 = df.drop('B',axis=1)

In [16]:
print(id(df),id(df4))

4657329904 4659413616

Pandas protects us by returning the result from `drop` as a new dataframe.

In [17]:
df4

   A       C
0  a  1.4142
1  b  1.6180
2  c  2.7183
3  d  3.1415